### 二年级男生仰卧起坐标准
def 二年级男生仰卧起坐计算分数(二年级男仰卧起坐数):
    # if isinstance(二年级男仰卧起坐数, float):
    #     return "男生仰卧起坐请输入整数"
    # if not isinstance(二年级男仰卧起坐数, (int,float)):
    #     return ValueError("请传入有效的数字类型仰卧起坐数值（单位：个）")

    if 二年级男仰卧起坐数 > 80:
        return ("太大", "超出80个，请检查")
    elif 46 <= 二年级男仰卧起坐数 <= 80:
        return (100, "优秀")
    elif 43 <= 二年级男仰卧起坐数 < 46:
        return (95, "优秀")
    elif 40 <= 二年级男仰卧起坐数 < 43:
        return (90, "优秀")
    elif 37 <= 二年级男仰卧起坐数 < 40:
        return (85, "良好")
    elif 34 <= 二年级男仰卧起坐数 < 37:
        return (80, "良好")
    elif 32 <= 二年级男仰卧起坐数 < 34:
        return (78, "及格")
    elif 30 <= 二年级男仰卧起坐数 < 32:
        return (76, "及格")
    elif 28 <= 二年级男仰卧起坐数 < 30:
        return (74, "及格")
    elif 26 <= 二年级男仰卧起坐数 < 28:
        return (72, "及格")
    elif 24 <= 二年级男仰卧起坐数 < 26:
        return (70, "及格")
    elif 22 <= 二年级男仰卧起坐数 < 24:
        return (68, "及格")
    elif 20 <= 二年级男仰卧起坐数 < 22:
        return (66, "及格")
    elif 18 <= 二年级男仰卧起坐数 < 20:
        return (64, "及格")
    elif 16 <= 二年级男仰卧起坐数 < 18:
        return (62, "及格")
    elif 14 <= 二年级男仰卧起坐数 < 16:
        return (60, "及格")
    elif 12 <= 二年级男仰卧起坐数 < 14:
        return (50, "不及格")
    elif 10 <= 二年级男仰卧起坐数 < 12:
        return (40, "不及格")
    elif 8 <= 二年级男仰卧起坐数 < 10:
        return (30, "不及格")
    elif 6 <= 二年级男仰卧起坐数 < 8:
        return (20, "不及格")
    elif 4 <= 二年级男仰卧起坐数 < 6:
        return (10, "不及格")
    elif 0 <= 二年级男仰卧起坐数 < 4:
        return (0, "不及格")
    else:
        return "请传入有效的数字类型仰卧起坐数值（单位：个）"


# 直接运行此文件时执行
if __name__ == "__main__":
    print("直接运行 触发：")
    print(f"男生得分：{二年级男生仰卧起坐计算分数(29.8)}")  # 输出100

    print(f"得分：{二年级男生仰卧起坐计算分数(46)[0]}")  # 输出100
    print(f"得分：{二年级男生仰卧起坐计算分数(46)[1]}")  # 输出100
    print(f"男生得分：{二年级男生仰卧起坐计算分数(16)}")  # 输出90


### 二年级女生仰卧起坐标准
def 二年级女生仰卧起坐计算分数(二年级女仰卧起坐数):
    # if isinstance(二年级女仰卧起坐数, float):
    #     return "男生仰卧起坐请输入整数"
    # if not isinstance(二年级女仰卧起坐数, (int,float)):
    #     return ValueError("请传入有效的数字类型仰卧起坐数值（单位：个）")

    if 二年级女仰卧起坐数 > 80:
        return ("太大", "超出80个，请检查")
    elif 44 <= 二年级女仰卧起坐数 <= 80:
        return (100, "优秀")
    elif 42 <= 二年级女仰卧起坐数 < 44:
        return (95, "优秀")
    elif 40 <= 二年级女仰卧起坐数 < 42:
        return (90, "优秀")
    elif 37 <= 二年级女仰卧起坐数 < 40:
        return (85, "良好")
    elif 34 <= 二年级女仰卧起坐数 < 37:
        return (80, "良好")
    elif 32 <= 二年级女仰卧起坐数 < 34:
        return (78, "及格")
    elif 30 <= 二年级女仰卧起坐数 < 32:
        return (76, "及格")
    elif 28 <= 二年级女仰卧起坐数 < 30:
        return (74, "及格")
    elif 26 <= 二年级女仰卧起坐数 < 28:
        return (72, "及格")
    elif 24 <= 二年级女仰卧起坐数 < 26:
        return (70, "及格")
    elif 22 <= 二年级女仰卧起坐数 < 24:
        return (68, "及格")
    elif 20 <= 二年级女仰卧起坐数 < 22:
        return (66, "及格")
    elif 18 <= 二年级女仰卧起坐数 < 20:
        return (64, "及格")
    elif 16 <= 二年级女仰卧起坐数 < 18:
        return (62, "及格")
    elif 14 <= 二年级女仰卧起坐数 < 16:
        return (60, "及格")
    elif 12 <= 二年级女仰卧起坐数 < 14:
        return (50, "不及格")
    elif 10 <= 二年级女仰卧起坐数 < 12:
        return (40, "不及格")
    elif 8 <= 二年级女仰卧起坐数 < 10:
        return (30, "不及格")
    elif 6 <= 二年级女仰卧起坐数 < 8:
        return (20, "不及格")
    elif 4 <= 二年级女仰卧起坐数 < 6:
        return (10, "不及格")
    elif 0 <= 二年级女仰卧起坐数 < 4:
        return (0, "不及格")
    else:
        return "请传入有效的数字类型仰卧起坐数值（单位：个）"


# 直接运行此文件时执行
if __name__ == "__main__":
    print("直接运行 触发：")
    print(f"得分：{二年级女生仰卧起坐计算分数(29.8)}")  # 输出100

    print(f"得分：{二年级女生仰卧起坐计算分数(46)[0]}")  # 输出100
    print(f"得分：{二年级女生仰卧起坐计算分数(46)[1]}")  # 输出100
    print(f"女生仰卧起坐得分：{二年级女生仰卧起坐计算分数(16)}")  # 输出90




### 三年级男生立定跳远标准
def 三年级男生立定跳远计算分数(三年级男立定跳远成绩):
    # if isinstance(三年级男立定跳远成绩, float):
    #     return "男生仰卧起坐请输入整数"
    # if not isinstance(三年级男立定跳远成绩, (int, float)):
    #     return ValueError("请传入有效的数字类型仰卧起坐数值（单位：厘米）")

    if 三年级男立定跳远成绩 > 220:
        return ("太大", "超出220厘米，请检查")
    elif 178 <= 三年级男立定跳远成绩 <= 220:
        return (100, "优秀")
    elif 177 <= 三年级男立定跳远成绩 < 178:
        return (98, "优秀")
    elif 175 <= 三年级男立定跳远成绩 < 177:
        return (96, "优秀")
    elif 174 <= 三年级男立定跳远成绩 < 175:
        return (94, "良好")
    elif 172 <= 三年级男立定跳远成绩 < 174:
        return (92, "良好")
    elif 170 <= 三年级男立定跳远成绩 < 172:
        return (90, "及格")
    elif 168 <= 三年级男立定跳远成绩 < 170:
        return (87, "及格")
    elif 165 <= 三年级男立定跳远成绩 < 168:
        return (84, "及格")
    elif 161 <= 三年级男立定跳远成绩 < 165:
        return (81, "及格")
    elif 157 <= 三年级男立定跳远成绩 < 161:
        return (78, "及格")
    elif 153 <= 三年级男立定跳远成绩 < 157:
        return (75, "及格")
    elif 150 <= 三年级男立定跳远成绩 < 153:
        return (72, "及格")
    elif 145 <= 三年级男立定跳远成绩 < 150:
        return (69, "及格")
    elif 141 <= 三年级男立定跳远成绩 < 145:
        return (66, "及格")
    elif 135 <= 三年级男立定跳远成绩 < 141:
        return (63, "及格")
    elif 129 <= 三年级男立定跳远成绩 < 135:
        return (60, "不及格")
    elif 128 <= 三年级男立定跳远成绩 < 129:
        return (50, "不及格")
    elif 126 <= 三年级男立定跳远成绩 < 128:
        return (40, "不及格")
    elif 123 <= 三年级男立定跳远成绩 < 126:
        return (30, "不及格")
    elif 120 <= 三年级男立定跳远成绩 < 123:
        return (20, "不及格")
    elif 117 <= 三年级男立定跳远成绩 < 120:
        return (10, "不及格")
    elif 0 <= 三年级男立定跳远成绩 < 117:
        return (0, "不及格")
    else:
        return "请传入有效的数字类型仰卧起坐数值（单位：个）"


# 直接运行此文件时执行
if __name__ == "__main__":
    print("直接运行 触发：")
    print(f"男生得分：{三年级男生立定跳远计算分数(129.8)}")  # 输出100

    print(f"得分：{三年级男生立定跳远计算分数(146)[0]}")  # 输出100
    print(f"得分：{三年级男生立定跳远计算分数(146)[1]}")  # 输出100
    print(f"三年级男生得分：{三年级男生立定跳远计算分数(166)}")  # 输出90



### 三年级女生立定跳远标准
def 三年级女生立定跳远计算分数(三年级女立定跳远成绩):
    # if isinstance(三年级女立定跳远成绩, float):
    #     return "男生仰卧起坐请输入整数"
    # if not isinstance(三年级女立定跳远成绩, (int, float)):
    #     return ValueError("请传入有效的数字类型仰卧起坐数值（单位：厘米）")

    if 三年级女立定跳远成绩 > 220:
        return ("太大", "超出220厘米，请检查")
    elif 167 <= 三年级女立定跳远成绩 <= 220:
        return (100, "优秀")
    elif 166 <= 三年级女立定跳远成绩 < 167:
        return (98, "优秀")
    elif 165 <= 三年级女立定跳远成绩 < 166:
        return (96, "优秀")
    elif 164 <= 三年级女立定跳远成绩 < 165:
        return (94, "良好")
    elif 162 <= 三年级女立定跳远成绩 < 164:
        return (92, "良好")
    elif 160 <= 三年级女立定跳远成绩 < 162:
        return (90, "及格")
    elif 158 <= 三年级女立定跳远成绩 < 160:
        return (87, "及格")
    elif 154 <= 三年级女立定跳远成绩 < 158:
        return (84, "及格")
    elif 151 <= 三年级女立定跳远成绩 < 154:
        return (81, "及格")
    elif 146 <= 三年级女立定跳远成绩 < 151:
        return (78, "及格")
    elif 141 <= 三年级女立定跳远成绩 < 146:
        return (75, "及格")
    elif 138 <= 三年级女立定跳远成绩 < 141:
        return (72, "及格")
    elif 134 <= 三年级女立定跳远成绩 < 138:
        return (69, "及格")
    elif 130 <= 三年级女立定跳远成绩 < 134:
        return (66, "及格")
    elif 125 <= 三年级女立定跳远成绩 < 130:
        return (63, "及格")
    elif 119 <= 三年级女立定跳远成绩 < 125:
        return (60, "不及格")
    elif 118 <= 三年级女立定跳远成绩 < 119:
        return (50, "不及格")
    elif 116 <= 三年级女立定跳远成绩 < 118:
        return (40, "不及格")
    elif 113 <= 三年级女立定跳远成绩 < 116:
        return (30, "不及格")
    elif 110 <= 三年级女立定跳远成绩 < 113:
        return (20, "不及格")
    elif 107 <= 三年级女立定跳远成绩 < 110:
        return (10, "不及格")
    elif 0 <= 三年级女立定跳远成绩 < 107:
        return (0, "不及格")
    else:
        return "请传入有效的数字类型仰卧起坐数值（单位：个）"


# 直接运行此文件时执行
if __name__ == "__main__":
    print("直接运行 触发：")
    print(f"男生得分：{三年级女生立定跳远计算分数(129.8)}")  # 输出100

    print(f"得分：{三年级女生立定跳远计算分数(146)[0]}")  # 输出100
    print(f"得分：{三年级女生立定跳远计算分数(146)[1]}")  # 输出100
    print(f"三年级女生得分：{三年级女生立定跳远计算分数(166)}")  # 输出90

### 四年级男生立定跳远标准
def 四年级男生立定跳远计算分数(四年级立定跳远成绩):
    # if isinstance(四年级立定跳远成绩, float):
    #     return "男生仰卧起坐请输入整数"
    # if not isinstance(四年级立定跳远成绩, (int, float)):
    #     return ValueError("请传入有效的数字类型仰卧起坐数值（单位：厘米）")

    if 四年级立定跳远成绩 > 230:
        return ("太大", "超出230厘米，请检查")
    elif 188 <= 四年级立定跳远成绩 <= 230:
        return (100, "优秀")
    elif 187 <= 四年级立定跳远成绩 < 188:
        return (98, "优秀")
    elif 185 <= 四年级立定跳远成绩 < 187:
        return (96, "优秀")
    elif 184 <= 四年级立定跳远成绩 < 185:
        return (94, "良好")
    elif 182 <= 四年级立定跳远成绩 < 184:
        return (92, "良好")
    elif 180 <= 四年级立定跳远成绩 < 182:
        return (90, "及格")
    elif 178 <= 四年级立定跳远成绩 < 180:
        return (87, "及格")
    elif 175 <= 四年级立定跳远成绩 < 178:
        return (84, "及格")
    elif 171 <= 四年级立定跳远成绩 < 175:
        return (81, "及格")
    elif 167 <= 四年级立定跳远成绩 < 171:
        return (78, "及格")
    elif 163 <= 四年级立定跳远成绩 < 167:
        return (75, "及格")
    elif 160 <= 四年级立定跳远成绩 < 163:
        return (72, "及格")
    elif 155 <= 四年级立定跳远成绩 < 160:
        return (69, "及格")
    elif 151 <= 四年级立定跳远成绩 < 155:
        return (66, "及格")
    elif 145 <= 四年级立定跳远成绩 < 151:
        return (63, "及格")
    elif 139 <= 四年级立定跳远成绩 < 145:
        return (60, "不及格")
    elif 138 <= 四年级立定跳远成绩 < 139:
        return (50, "不及格")
    elif 136 <= 四年级立定跳远成绩 < 138:
        return (40, "不及格")
    elif 133 <= 四年级立定跳远成绩 < 136:
        return (30, "不及格")
    elif 130 <= 四年级立定跳远成绩 < 133:
        return (20, "不及格")
    elif 127 <= 四年级立定跳远成绩 < 130:
        return (10, "不及格")
    elif 0 <= 四年级立定跳远成绩 < 127:
        return (0, "不及格")
    else:
        return "请传入有效的数字类型仰卧起坐数值（单位：个）"

# 直接运行此文件时执行
if __name__ == "__main__":
    print("直接运行 触发：")
    print(f"男生得分：{四年级男生立定跳远计算分数(129.8)}")  # 输出100

    print(f"得分：{四年级男生立定跳远计算分数(146)[0]}")  # 输出100
    print(f"得分：{四年级男生立定跳远计算分数(146)[1]}")  # 输出100
    print(f"四年级男生得分：{四年级男生立定跳远计算分数(166)}")  # 输出90


### 四年级女生立定跳远标准
def 四年级女生立定跳远计算分数(四年级立定跳远成绩):
    # if isinstance(四年级立定跳远成绩, float):
    #     return "男生仰卧起坐请输入整数"
    # if not isinstance(四年级立定跳远成绩, (int, float)):
    #     return ValueError("请传入有效的数字类型仰卧起坐数值（单位：厘米）")

    if 四年级立定跳远成绩 > 230:
        return ("太大", "超出230厘米，请检查")
    elif 177 <= 四年级立定跳远成绩 <= 230:
        return (100, "优秀")
    elif 176 <= 四年级立定跳远成绩 < 177:
        return (98, "优秀")
    elif 175 <= 四年级立定跳远成绩 < 176:
        return (96, "优秀")
    elif 174 <= 四年级立定跳远成绩 < 175:
        return (94, "良好")
    elif 172 <= 四年级立定跳远成绩 < 174:
        return (92, "良好")
    elif 170 <= 四年级立定跳远成绩 < 172:
        return (90, "及格")
    elif 168 <= 四年级立定跳远成绩 < 170:
        return (87, "及格")
    elif 164 <= 四年级立定跳远成绩 < 168:
        return (84, "及格")
    elif 161 <= 四年级立定跳远成绩 < 164:
        return (81, "及格")
    elif 156 <= 四年级立定跳远成绩 < 161:
        return (78, "及格")
    elif 151 <= 四年级立定跳远成绩 < 156:
        return (75, "及格")
    elif 148 <= 四年级立定跳远成绩 < 151:
        return (72, "及格")
    elif 144 <= 四年级立定跳远成绩 < 148:
        return (69, "及格")
    elif 140 <= 四年级立定跳远成绩 < 144:
        return (66, "及格")
    elif 135 <= 四年级立定跳远成绩 < 140:
        return (63, "及格")
    elif 129 <= 四年级立定跳远成绩 < 135:
        return (60, "不及格")
    elif 128 <= 四年级立定跳远成绩 < 129:
        return (50, "不及格")
    elif 126 <= 四年级立定跳远成绩 < 128:
        return (40, "不及格")
    elif 123 <= 四年级立定跳远成绩 < 126:
        return (30, "不及格")
    elif 120 <= 四年级立定跳远成绩 < 123:
        return (20, "不及格")
    elif 117 <= 四年级立定跳远成绩 < 120:
        return (10, "不及格")
    elif 0 <= 四年级立定跳远成绩 < 117:
        return (0, "不及格")
    else:
        return "请传入有效的数字类型仰卧起坐数值（单位：个）"

# 直接运行此文件时执行
if __name__ == "__main__":
    print("直接运行 触发：")
    print(f"女生得分：{四年级女生立定跳远计算分数(129.8)}")  # 输出100

    print(f"得分：{四年级女生立定跳远计算分数(146)[0]}")  # 输出100
    print(f"得分：{四年级女生立定跳远计算分数(146)[1]}")  # 输出100
    print(f"四年级女生得分：{四年级女生立定跳远计算分数(166)}")  # 输出90







### 五年级直臂悬垂标准
def 五年级直臂悬垂计算分数(五年级直臂悬垂成绩):
    # if isinstance(五年级直臂悬垂成绩, float):
    #     return "男生仰卧起坐请输入整数"
    # if not isinstance(五年级直臂悬垂成绩, (int, float)):
    #     return ValueError("请传入有效的数字类型仰卧起坐数值（单位：秒）")

    if 五年级直臂悬垂成绩 > 220:
        return ("太大", "超出220秒，请检查")
    elif 60 <= 五年级直臂悬垂成绩 <= 220:
        return (100, "优秀")
    elif 55 <= 五年级直臂悬垂成绩 < 60:
        return (95, "优秀")
    elif 50 <= 五年级直臂悬垂成绩 < 55:
        return (90, "优秀")
    elif 45 <= 五年级直臂悬垂成绩 < 50:
        return (85, "良好")
    elif 35 <= 五年级直臂悬垂成绩 < 45:
        return (80, "良好")
    elif 32 <= 五年级直臂悬垂成绩 < 35:
        return (78, "及格")
    elif 30 <= 五年级直臂悬垂成绩 < 32:
        return (74, "及格")
    elif 27 <= 五年级直臂悬垂成绩 < 30:
        return (70, "及格")
    elif 25 <= 五年级直臂悬垂成绩 < 27:
        return (66, "及格")
    elif 20 <= 五年级直臂悬垂成绩 < 25:
        return (60, "及格")
    elif 17 <= 五年级直臂悬垂成绩 < 20:
        return (50, "及格")
    elif 15 <= 五年级直臂悬垂成绩 < 17:
        return (40, "及格")
    elif 13 <= 五年级直臂悬垂成绩 < 15:
        return (30, "及格")
    elif 6 <= 五年级直臂悬垂成绩 < 13:
        return (20, "及格")
    elif 3 <= 五年级直臂悬垂成绩 < 6:
        return (10, "及格")
    elif 0 <= 五年级直臂悬垂成绩 < 3:
        return (0, "不及格")
    else:
        return "请传入有效的数字类型仰卧起坐数值（单位：秒）"


# 直接运行此文件时执行
if __name__ == "__main__":
    print("直接运行 触发：")
    print(f"男生得分：{五年级直臂悬垂计算分数(129.8)}")  # 输出100

    print(f"得分：{五年级直臂悬垂计算分数(146)[0]}")  # 输出100
    print(f"得分：{五年级直臂悬垂计算分数(146)[1]}")  # 输出100
    print(f"五年级得分：{五年级直臂悬垂计算分数(166)}")  # 输出90



### 六年级直臂悬垂标准
def 六年级直臂悬垂计算分数(六年级直臂悬垂成绩):
    # if isinstance(六年级直臂悬垂成绩, float):
    #     return "男生仰卧起坐请输入整数"
    # if not isinstance(六年级直臂悬垂成绩, (int, float)):
    #     return ValueError("请传入有效的数字类型仰卧起坐数值（单位：秒）")

    if 六年级直臂悬垂成绩 > 220:
        return ("太大", "超出220秒，请检查")
    elif 70 <= 六年级直臂悬垂成绩 <= 220:
        return (100, "优秀")
    elif 65 <= 六年级直臂悬垂成绩 < 70:
        return (95, "优秀")
    elif 60 <= 六年级直臂悬垂成绩 < 65:
        return (90, "优秀")
    elif 50 <= 六年级直臂悬垂成绩 < 60:
        return (85, "良好")
    elif 45 <= 六年级直臂悬垂成绩 < 50:
        return (80, "良好")
    elif 42 <= 六年级直臂悬垂成绩 < 45:
        return (78, "及格")
    elif 38 <= 六年级直臂悬垂成绩 < 42:
        return (74, "及格")
    elif 36 <= 六年级直臂悬垂成绩 < 38:
        return (70, "及格")
    elif 33 <= 六年级直臂悬垂成绩 < 36:
        return (66, "及格")
    elif 30 <= 六年级直臂悬垂成绩 < 33:
        return (60, "及格")
    elif 25 <= 六年级直臂悬垂成绩 < 30:
        return (50, "及格")
    elif 20 <= 六年级直臂悬垂成绩 < 25:
        return (40, "及格")
    elif 15 <= 六年级直臂悬垂成绩 < 20:
        return (30, "及格")
    elif 10 <= 六年级直臂悬垂成绩 < 15:
        return (20, "及格")
    elif 5 <= 六年级直臂悬垂成绩 < 10:
        return (10, "及格")
    elif 0 <= 六年级直臂悬垂成绩 < 5:
        return (0, "不及格")
    else:
        return "请传入有效的数字类型仰卧起坐数值（单位：秒）"


# 直接运行此文件时执行
if __name__ == "__main__":
    print("直接运行 触发：")
    print(f"男生得分：{六年级直臂悬垂计算分数(129.8)}")  # 输出100

    print(f"得分：{六年级直臂悬垂计算分数(146)[0]}")  # 输出100
    print(f"得分：{六年级直臂悬垂计算分数(146)[1]}")  # 输出100
    print(f"六年级得分：{六年级直臂悬垂计算分数(166)}")  # 输出90