### 一年级男生BMI标准
def 一年级男生体重指数计算分数(一年级男体重指数):
    # if isinstance(一年级男体重指数, float):
    #     return "男生体重指数输入整数"
    # if not isinstance(一年级男体重指数, (int,float)):
    #     return ValueError("请传入有效的数字类型体重指数值（单位：个）")

    # if 一年级男体重指数 >= 80:
    #     return (-1, "超出80个，请检查")
    if 13.5 <= 一年级男体重指数 <= 18.1:
        return (100, "优秀")
    elif  一年级男体重指数 <= 13.4:
        return (80, "良好")
    elif 18.2 <= 一年级男体重指数 <= 20.3:
        return (80, "良好")
    elif 20.4 <= 一年级男体重指数 :
        return (60, "及格")

    else:
        return "请传入有效的数字类型体重指数值（单位：个）"

# 直接运行此文件时执行
if __name__ == "__main__":
    print("直接运行 触发：")
    print(f"男生得分：{一年级男生体重指数计算分数(29)}")  # 输出100

    print(f"得分：{一年级男生体重指数计算分数(15)[0]}")  # 输出100
    print(f"得分：{一年级男生体重指数计算分数(15)[1]}")  # 输出100
    print(f"男生得分：{一年级男生体重指数计算分数(13.4)}")  # 输出90

### 一年级女生BMI标准
def 一年级女生体重指数计算分数(一年级女体重指数):
    # if isinstance(一年级女体重指数, float):
    #     return "女生体重指数输入整数"
    # if not isinstance(一年级女体重指数, (int,float)):
    #     return ValueError("请传入有效的数字类型体重指数值（单位：个）")

    # if 一年级女体重指数 >= 80:
    #     return (-1, "超出80个，请检查")
    if 13.3 <= 一年级女体重指数 <= 17.3:
        return (100, "优秀")
    elif  一年级女体重指数 <= 13.2:
        return (80, "良好")
    elif 17.4 <= 一年级女体重指数 <= 19.2:
        return (80, "良好")
    elif 19.3 <= 一年级女体重指数 :
        return (60, "及格")

    else:
        return "请传入有效的数字类型体重指数值（单位：个）"

# 直接运行此文件时执行
if __name__ == "__main__":
    print("直接运行 触发：")
    print(f"女生得分：{一年级女生体重指数计算分数(29)}")  # 输出100

    print(f"得分：{一年级女生体重指数计算分数(15)[0]}")  # 输出100
    print(f"得分：{一年级女生体重指数计算分数(15)[1]}")  # 输出100
    print(f"女生得分：{一年级女生体重指数计算分数(13.4)}")  # 输出90


### 二年级男生BMI标准
def 二年级男生体重指数计算分数(二年级男体重指数):
    # if isinstance(二年级男体重指数, float):
    #     return "男生体重指数输入整数"
    # if not isinstance(二年级男体重指数, (int,float)):
    #     return ValueError("请传入有效的数字类型体重指数值（单位：个）")

    # if 二年级男体重指数 >= 80:
    #     return (-1, "超出80个，请检查")
    if 13.7 <= 二年级男体重指数 <= 18.4:
        return (100, "优秀")
    elif  二年级男体重指数 <= 13.6:
        return (80, "良好")
    elif 18.5 <= 二年级男体重指数 <= 20.4:
        return (80, "良好")
    elif 20.5 <= 二年级男体重指数 :
        return (60, "及格")

    else:
        return "请传入有效的数字类型体重指数值（单位：个）"

# 直接运行此文件时执行
if __name__ == "__main__":
    print("直接运行 触发：")
    print(f"男生得分：{二年级男生体重指数计算分数(29)}")  # 输出100

    print(f"得分：{二年级男生体重指数计算分数(15)[0]}")  # 输出100
    print(f"得分：{二年级男生体重指数计算分数(15)[1]}")  # 输出100
    print(f"男生得分：{二年级男生体重指数计算分数(13.4)}")  # 输出90



### 二年级女生BMI标准
def 二年级女生体重指数计算分数(二年级女体重指数):
    # if isinstance(二年级女体重指数, float):
    #     return "女生体重指数输入整数"
    # if not isinstance(二年级女体重指数, (int,float)):
    #     return ValueError("请传入有效的数字类型体重指数值（单位：个）")

    # if 二年级女体重指数 >= 80:
    #     return (-1, "超出80个，请检查")
    if 13.5 <= 二年级女体重指数 <= 17.8:
        return (100, "优秀")
    elif  二年级女体重指数 <= 13.4:
        return (80, "良好")
    elif 17.9 <= 二年级女体重指数 <= 20.2:
        return (80, "良好")
    elif 20.3 <= 二年级女体重指数 :
        return (60, "及格")

    else:
        return "请传入有效的数字类型体重指数值（单位：个）"

# 直接运行此文件时执行
if __name__ == "__main__":
    print("直接运行 触发：")
    print(f"女生得分：{二年级女生体重指数计算分数(29)}")  # 输出100

    print(f"得分：{二年级女生体重指数计算分数(15)[0]}")  # 输出100
    print(f"得分：{二年级女生体重指数计算分数(15)[1]}")  # 输出100
    print(f"女生得分：{二年级女生体重指数计算分数(13.4)}")  # 输出90



### 三年级男生BMI标准
def 三年级男生体重指数计算分数(三年级男体重指数):
    # if isinstance(三年级男体重指数, float):
    #     return "男生体重指数输入整数"
    # if not isinstance(三年级男体重指数, (int,float)):
    #     return ValueError("请传入有效的数字类型体重指数值（单位：个）")

    # if 三年级男体重指数 >= 80:
    #     return (-1, "超出80个，请检查")
    if 13.9 <= 三年级男体重指数 <= 19.4:
        return (100, "优秀")
    elif 三年级男体重指数 <= 13.8:
        return (80, "良好")
    elif 19.5 <= 三年级男体重指数 <= 22.1:
        return (80, "良好")
    elif 22.2 <= 三年级男体重指数:
        return (60, "及格")

    else:
        return "请传入有效的数字类型体重指数值（单位：个）"

    # 直接运行此文件时执行

if __name__ == "__main__":
    print("直接运行 触发：")
    print(f"男生得分：{三年级男生体重指数计算分数(29)}")  # 输出100

    print(f"得分：{三年级男生体重指数计算分数(15)[0]}")  # 输出100
    print(f"得分：{三年级男生体重指数计算分数(15)[1]}")  # 输出100
    print(f"男生得分：{三年级男生体重指数计算分数(13.4)}")  # 输出90

    ### 三年级女生BMI标准

### 三年级女生BMI标准
def 三年级女生体重指数计算分数(三年级女体重指数):
    # if isinstance(三年级女体重指数, float):
    #     return "女生体重指数输入整数"
    # if not isinstance(三年级女体重指数, (int,float)):
    #     return ValueError("请传入有效的数字类型体重指数值（单位：个）")

    # if 三年级女体重指数 >= 80:
    #     return (-1, "超出80个，请检查")
    if 13.6 <= 三年级女体重指数 <= 18.6:
        return (100, "优秀")
    elif 三年级女体重指数 <= 13.5:
        return (80, "良好")
    elif 18.7 <= 三年级女体重指数 <= 21.1:
        return (80, "良好")
    elif 21.2 <= 三年级女体重指数:
        return (60, "及格")

    else:
        return "请传入有效的数字类型体重指数值（单位：个）"

    # 直接运行此文件时执行

if __name__ == "__main__":
    print("直接运行 触发：")
    print(f"女生得分：{三年级女生体重指数计算分数(29)}")  # 输出100

    print(f"得分：{三年级女生体重指数计算分数(15)[0]}")  # 输出100
    print(f"得分：{三年级女生体重指数计算分数(15)[1]}")  # 输出100
    print(f"女生得分：{三年级女生体重指数计算分数(13.4)}")  # 输出90




### 四年级男生BMI标准
def 四年级男生体重指数计算分数(四年级男体重指数):
    # if isinstance(四年级男体重指数, float):
    #     return "男生体重指数输入整数"
    # if not isinstance(四年级男体重指数, (int,float)):
    #     return ValueError("请传入有效的数字类型体重指数值（单位：个）")

    # if 四年级男体重指数 >= 80:
    #     return (-1, "超出80个，请检查")
    if 14.2 <= 四年级男体重指数 <= 20.1:
        return (100, "优秀")
    elif 四年级男体重指数 <= 14.1:
        return (80, "良好")
    elif 20.2 <= 四年级男体重指数 <= 22.6:
        return (80, "良好")
    elif 22.7 <= 四年级男体重指数:
        return (60, "及格")

    else:
        return "请传入有效的数字类型体重指数值（单位：个）"

    # 直接运行此文件时执行

if __name__ == "__main__":
    print("直接运行 触发：")
    print(f"男生得分：{四年级男生体重指数计算分数(29)}")  # 输出100

    print(f"得分：{四年级男生体重指数计算分数(15)[0]}")  # 输出100
    print(f"得分：{四年级男生体重指数计算分数(15)[1]}")  # 输出100
    print(f"男生得分：{四年级男生体重指数计算分数(13.4)}")  # 输出90

    ### 四年级女生BMI标准

### 四年级女生BMI标准
def 四年级女生体重指数计算分数(四年级女体重指数):
    # if isinstance(四年级女体重指数, float):
    #     return "女生体重指数输入整数"
    # if not isinstance(四年级女体重指数, (int,float)):
    #     return ValueError("请传入有效的数字类型体重指数值（单位：个）")

    # if 四年级女体重指数 >= 80:
    #     return (-1, "超出80个，请检查")
    if 13.7 <= 四年级女体重指数 <= 19.4:
        return (100, "优秀")
    elif 四年级女体重指数 <= 13.6:
        return (80, "良好")
    elif 19.5 <= 四年级女体重指数 <= 22.0:
        return (80, "良好")
    elif 22.1 <= 四年级女体重指数:
        return (60, "及格")

    else:
        return "请传入有效的数字类型体重指数值（单位：个）"

    # 直接运行此文件时执行

if __name__ == "__main__":
    print("直接运行 触发：")
    print(f"女生得分：{四年级女生体重指数计算分数(29)}")  # 输出100

    print(f"得分：{四年级女生体重指数计算分数(15)[0]}")  # 输出100
    print(f"得分：{四年级女生体重指数计算分数(15)[1]}")  # 输出100
    print(f"女生得分：{四年级女生体重指数计算分数(13.4)}")  # 输出90


### 五年级男生BMI标准
def 五年级男生体重指数计算分数(五年级男体重指数):
    # if isinstance(五年级男体重指数, float):
    #     return "男生体重指数输入整数"
    # if not isinstance(五年级男体重指数, (int,float)):
    #     return ValueError("请传入有效的数字类型体重指数值（单位：个）")

    # if 五年级男体重指数 >= 80:
    #     return (-1, "超出80个，请检查")
    if 14.4 <= 五年级男体重指数 <= 21.4:
        return (100, "优秀")
    elif 五年级男体重指数 <= 14.3:
        return (80, "良好")
    elif 21.5 <= 五年级男体重指数 <= 24.1:
        return (80, "良好")
    elif 24.2 <= 五年级男体重指数:
        return (60, "及格")

    else:
        return "请传入有效的数字类型体重指数值（单位：个）"

    # 直接运行此文件时执行

if __name__ == "__main__":
    print("直接运行 触发：")
    print(f"男生得分：{五年级男生体重指数计算分数(29)}")  # 输出100

    print(f"得分：{五年级男生体重指数计算分数(15)[0]}")  # 输出100
    print(f"得分：{五年级男生体重指数计算分数(15)[1]}")  # 输出100
    print(f"男生得分：{五年级男生体重指数计算分数(13.4)}")  # 输出90

    ### 五年级女生BMI标准

### 五年级女生BMI标准
def 五年级女生体重指数计算分数(五年级女体重指数):
    # if isinstance(五年级女体重指数, float):
    #     return "女生体重指数输入整数"
    # if not isinstance(五年级女体重指数, (int,float)):
    #     return ValueError("请传入有效的数字类型体重指数值（单位：个）")

    # if 五年级女体重指数 >= 80:
    #     return (-1, "超出80个，请检查")
    if 13.8 <= 五年级女体重指数 <= 20.5:
        return (100, "优秀")
    elif 五年级女体重指数 <= 13.7:
        return (80, "良好")
    elif 20.6 <= 五年级女体重指数 <= 22.9:
        return (80, "良好")
    elif 23 <= 五年级女体重指数:
        return (60, "及格")

    else:
        return "请传入有效的数字类型体重指数值（单位：个）"

    # 直接运行此文件时执行

if __name__ == "__main__":
    print("直接运行 触发：")
    print(f"女生得分：{五年级女生体重指数计算分数(29)}")  # 输出100

    print(f"得分：{五年级女生体重指数计算分数(15)[0]}")  # 输出100
    print(f"得分：{五年级女生体重指数计算分数(15)[1]}")  # 输出100
    print(f"女生得分：{五年级女生体重指数计算分数(13.4)}")  # 输出90


### 六年级男生BMI标准
def 六年级男生体重指数计算分数(六年级男体重指数):
    # if isinstance(六年级男体重指数, float):
    #     return "男生体重指数输入整数"
    # if not isinstance(六年级男体重指数, (int,float)):
    #     return ValueError("请传入有效的数字类型体重指数值（单位：个）")

    # if 六年级男体重指数 >= 80:
    #     return (-1, "超出80个，请检查")
    if 14.7 <= 六年级男体重指数 <= 21.8:
        return (100, "优秀")
    elif 六年级男体重指数 <= 14.6:
        return (80, "良好")
    elif 21.9 <= 六年级男体重指数 <= 24.5:
        return (80, "良好")
    elif 24.6 <= 六年级男体重指数:
        return (60, "及格")

    else:
        return "请传入有效的数字类型体重指数值（单位：个）"

    # 直接运行此文件时执行

if __name__ == "__main__":
    print("直接运行 触发：")
    print(f"男生得分：{六年级男生体重指数计算分数(29)}")  # 输出100

    print(f"得分：{六年级男生体重指数计算分数(15)[0]}")  # 输出100
    print(f"得分：{六年级男生体重指数计算分数(15)[1]}")  # 输出100
    print(f"男生得分：{六年级男生体重指数计算分数(13.4)}")  # 输出90

    ### 六年级女生BMI标准

### 六年级女生BMI标准
def 六年级女生体重指数计算分数(六年级女体重指数):
    # if isinstance(六年级女体重指数, float):
    #     return "女生体重指数输入整数"
    # if not isinstance(六年级女体重指数, (int,float)):
    #     return ValueError("请传入有效的数字类型体重指数值（单位：个）")

    # if 六年级女体重指数 >= 80:
    #     return (-1, "超出80个，请检查")
    if 14.2 <= 六年级女体重指数 <= 20.8:
        return (100, "优秀")
    elif 六年级女体重指数 <= 14.1:
        return (80, "良好")
    elif 20.9 <= 六年级女体重指数 <= 23.6:
        return (80, "良好")
    elif 23.7 <= 六年级女体重指数:
        return (60, "及格")

    else:
        return "请传入有效的数字类型体重指数值（单位：个）"

    # 直接运行此文件时执行

if __name__ == "__main__":
    print("直接运行 触发：")
    print(f"女生得分：{六年级女生体重指数计算分数(29)}")  # 输出100

    print(f"得分：{六年级女生体重指数计算分数(15)[0]}")  # 输出100
    print(f"得分：{六年级女生体重指数计算分数(15)[1]}")  # 输出100
    print(f"女生得分：{六年级女生体重指数计算分数(13.4)}")  # 输出90

